'''У вас есть переменная n которая содержит входные пользовательские данные.
n - (0 < n < 100) - количество голов драконьей стаи.
На планете обитают драконы, и сила драконьей стаи зависит от количества голов у каждого дракона. 
Однако, чтобы максимально увеличить силу стаи, необходимо распределить головы между драконами так, 
чтобы их произведение было максимальным.
Напишите код, который по заданному количеству голов драконьей стаи n определит максимальную силу 
этой стаи, учитывая, что каждый дракон должен иметь одинаковое количество голов.
Результат записать в переменную result. 
Важно!
Для максимальной силы стаи нужно распределить головы так, чтобы произведение было максимальным.
Если количество голов меньше или равно 2, то максимальная сила равна количеству голов.
В остальных случаях, разбейте количество голов на множители 3 и, если останется одна голова, 
добавьте один множитель 2.'''

#n = int(input())
n=6
n=int(n)

# -- ваш код начинается тут



# -- ваш код заканчивается тут

print(result)