#  непубличные методы
# Инкапсуляция - приватные аттрибуты и приватные методы
'''Приватные методы в объектно-ориентированном программировании (ООП) на Python — 
это методы, которые доступны только внутри класса, где они определены. 
К ним нельзя получить доступ из других объектов или другого места программы. 
thecode.media
ru.hexlet.io
diveintopython.org
Приватные методы используются для внутренних операций в классе, повышая инкапсуляцию и 
предотвращая случайное неправильное использование или переопределение.'''

