'''Домашнее задание к занятию 5. Превращаем программу ToDo в бота
Задание 1
Бот уже готов и им можно пользоваться. Чтоб закрепить все навыки, можно расширить функциональность бота возможностями на ваш выбор.

Примеры дополнительных возможностей:

Выводить ошибку, если в имени задачи менее 3х символов Проверять длину задачи перед добавлением. Если меньше 3 символов — отправлять ошибку. Ошибка: задача должна содержать не менее 3 символов.
Печатать задачи на несколько дат Команда /print принимает несколько дат: /print 01.04 02.04 03.04 — выводит задачи на каждую из дат.
Добавить команду /all Команда /all выводит все задачи, сгруппированные по датам. Даты оформлять жирным через дата.
Сортировка задач по алфавиту или дате При использовании команды /print или /all можно добавить возможность сортировки задач.
Например:

/print 03.04 sort=alpha — выводит задачи за указанную дату, отсортированные по алфавиту.
/all sort=date — выводит все задачи, сгруппированные и отсортированные по датам.
Возможность редактирования или удаления задач
Реализовать команды:

/edit номер_задачи новое_описание — изменение текста задачи
/delete номер_задачи — удаление задачи по порядковому номеру в списке
Во всех командах выводить даты жирным текстом. Для этого используйте разметку markdown, 
когда в начале и в конце текста ставятся *. Чтоб применился markdown нужно у метода 
send_message, передать параметр parse_mode='MarkdownV2''''