'''
Инструкция к выполнению домашнего задания
Домашнее задание выполните в Google Docs и отправьте на проверку ссылку на ваш документ в личном кабинете.
В названии файла введите корректное название лекции и вашу фамилию и имя.
Зайдите в “Настройки доступа” и выберите доступ “Просматривать могут все в Интернете, у кого есть ссылка”.
Скопируйте текст задания в свой документ.
Выберите удобный вам редактор для построения блок-схем. Например, Paint или редактор diagrams.net, который использовали на занятии.
Постройте в редакторе блок-схемы алгоритма по каждому заданию и сделайте скриншот каждого алгоритма. Итого у вас получится 3 алгоритма, каждый из которых состоит из 4 скриншотов.
Запишите ответы и приложите необходимые скриншоты в свой Google-документ.
Для проверки домашнего задания отправьте ссылку на ваш документ в личном кабинете Нетологии.
Обратите внимание, что это домашнее задание с самопроверкой. После отправки задания в личном кабинете вы получите ссылку на правильные ответы с подробными комментариями к решениям.
Проверьте свои ответы и эталонное решение. При необходимости внесите правки в свой файл.
Выберите три бытовые рутинные задачи на ваше усмотрение — предлагаем вам потренироваться в составлении алгоритмов на основе них. Например, бытовой задачей может быть помыть посуду или пойти в поход с друзьями. Вы можете придумать свои варианты или взять уже предложенные.

Задание 1. Реализация линейного алгоритма.
Реализуйте линейный алгоритм не менее чем из 3 действий на каждую выбранную задачу. Итого у вас получится 3 алгоритма.

Задание 2. Ветвление
Дополните каждый алгоритм, описанный в задании 1, одним или более условиями.

Пример для алгоритма «помыть посуду» Вариантом условия может быть проверка «посуды для мытья много?», истина — «используем посудомоечную машину», ложь — «моем вручную». Какие ещё могут быть ситуации, требующие принять какое-то решение, в каждой задаче? Добавьте ваш вариант в каждый алгоритм.

Задание 3. Циклы.
Добавьте циклы в каждый ранее составленный алгоритм. Подумайте, какие повторяющиеся действия могут возникать в каждом алгоритме. Дополните алгоритмы циклами.

Например, может быть такой вариант: «посуда чистая?», истина — «вытираем досуха», ложь — «снова моем посуду», то есть повторяем цикл ещё раз. Также при мытье посуды надо тереть сковороду определённое количество раз, пока она недостаточно чистая.

Задание 4. Подпрограммы.
Проанализируйте 3 получившихся алгоритма. Возможно, в них есть те части, которые можно вынести в отдельные подпрограммы (это может быть тело цикла, состоящее только из нескольких действий или из нескольких действий с условиями и циклами). Дополните алгоритмы подпрограммами, если это возможно, а если нет — опишите текстом, почему, по вашему мнению, подпрограмму в этом алгоритме, выделить нельзя.

Например, в алгоритме «мытьё посуды» можно выделить отдельную подпрограмму «мытьё посуды в посудомоечной машине» с действиями «открыть дверцу», «загрузить посуду», «добавить моющее средство».
'''